app/Controllers/AdminController.php

    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $adminModel = new AdminModel();
        $admin = $adminModel->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'eva@gmail.com'
 LIMIT 1