app/Models/PesanModel.php

    public function getAllComments($searchValue = '', $order = 'asc')
    {
        $db = \Config\Database::connect();
        $query = $db->table('tablepesan')
            ->select('id, nama, email, subjek, pesan, tanggal')
            ->like('id', $searchValue)
            ->orLike('nama', $searchValue)
            ->orLike('email', $searchValue)
            ->orLike('subjek', $searchValue)
            ->orLike('pesan', $searchValue)
            ->orLike('tanggal', $searchValue)
            ->orderBy('tanggal', $order)
            ->get();
---
SELECT `id`, `nama`, `email`, `subjek`, `pesan`, `tanggal`
FROM `tablepesan`
WHERE `id` LIKE '%%' ESCAPE '!'
OR  `nama` LIKE '%%' ESCAPE '!'
OR  `email` LIKE '%%' ESCAPE '!'
OR  `subjek` LIKE '%%' ESCAPE '!'
OR  `pesan` LIKE '%%' ESCAPE '!'
OR  `tanggal` LIKE '%%' ESCAPE '!'
ORDER BY `tanggal` DESC